{
   
    "bray.study": {
        "traits": ["location"],
        "descriptions": {
            "definite": "the study",
            "location": "The study has faded wood-panelling on the walls. There is a large desk in the centre of the room. The desk has a number of papers piled on it."
        },
        "exits": {
            "north": "bray.master-bedroom"
        },
    },
    
    
    "bray.desk": {
        "names": ["desk"],
        "descriptions": {
            "indefinite": "a desk",
            "definite": "the desk",
            "detailed": "The desk is a large heavy desk with a single drawer. There are a pile of papers on the surface of the desk. They are a curious mix of unpaid bills and legal documents relating to John Bray’s attempt to change his last will and testament. The will itself is nowhere to be seen.",
            "contentPrefix": "The desk contains",
            "contains.bray.note": " Under these papers is a half-written note."
        },
        "location": "bray.study"
    },

    "bray.drawer": {
        "traits": ["lockable", "openable"],
        "names": ["drawer", "desk drawer"],
        "descriptions": {
            "indefinite": "a single drawer",
            "definite": "the drawer",
            "detailed": "A desk drawer.",
            "unlock": "The small key fits the small lock of the drawer. It makes a faint click as it is turned.",
            "lock": "You lock the drawer using the steel key.",
            "open": "You pull the drawer open and examine its contents.",
            "contentPrefix": "The drawer contains"
        },
        "locked": true,
        "requires": "bray.desk-key",
        "location": "bray.desk",
        "showContentWhen": "opened"
    },
    
    "bray.note": {
        "names": ["note"],
        "traits": ["movable"],
        "descriptions": {
            "indefinite": "a handwritten note",
            "definite": "the note",
            "detailed": "'Monday 20th October 1879.\n\nThings cannot go on this way. Both the cook and the maid refuse to come to the house, even by day. I hear her every night, prowling the garden. She is growing bolder. Two nights ago, I saw her from the window in the drawing room, not ten feet away from the house. The danger is real. I went to town today and spoke to Utterson about trying to change my will, should something happen to me. I lock the doors at night but I have doubts that it would stop her, should she set her mind on getting inside. I have spent so many sleepless nights trying to find a cure or remedy for her condition but with no success, only frustration and disappointment. I now sleep with my old service revolver by my side. I shudder with the thought of what I must do and wonder if I have the courage...\nSweet, sweet Cecile, what has happened to you?'"
        },
        "location": { "location": "bray.desk", "position": "on" }
    },

    "bray.garden-key": {
        "names": ["key", "brass key"],
        "traits": ["movable"],
        "descriptions": {
            "indefinite": "a brass key",
            "definite": "the brass key",
            "detailed": "This is a polished brass key."
        },
        "location": "bray.drawer"
    },
    
    "bray.envelope": {
        "traits": ["movable"],
        "names": ["envelope"],
        "descriptions": {
            "indefinite": "an envelope",
            "definite": "the envelope",
            "detailed": "The envelope contains the last will and testament of John Bray. Dated the 20th October 1879, it details the management of his estate in the event of his death or ‘untimely disappearance’. There is no mention of his daughter inheriting anything. All his wealth, property, and land is to be held in Trust for the benefit of the village of Featherwell ‘who have suffered dreadfully because of the curse that has long afflicted the Bray family.’"
        },
        "location": "bray.drawer"
    },
}
