{
    "bray.drawing-room": {
        "traits": ["location"],
        "descriptions": {
            "definite": "the drawing room",
            "location": "The room is filled with furniture that has succumbed to the ravages of time. A bookcase stands against one wall and moonlight pours through the large bay windows. You hear something snarl in the garden."
        },
        "exits": {
            "south": "bray.hall"
        },
    },
    
    "bray.bray-windows": {
        "names": ["windows", "bay windows", "bay"],
        "descriptions": {
            "indefinite": "some bay windows",
            "definite": "the windows",
            "detailed": "Peering out of the bay windows, you can see the garden at the rear of the manor. By the pale light of the moon you can make out the overgrown lawn and a number of untended flower beds that have become overrun with weeds. Something moves in the undergrowth. Although only a fleeting glimpse, it was large and hairy and appeared to be walking on two legs.",
        },
        "location": "bray.drawing-room",
    },
    
    "bray.bookcase": {
        "names": ["bookcase"],
        "descriptions": {
            "definite": "the bookcase",
            "detailed": "The bookcase is large and takes up much of the west wall and half of the south wall of the room. Many of the leather-bound books are dry tomes of law or local history. There is a book that catches your eye, 'Mysteries of the Unknown'.",
            "indefinite": "a bookcase",
            "not-examined": " There is a key on top of the bookcase.",
            "contentPrefix": "The bookcase contains"
        },
        "location": "bray.drawing-room",
        "showContentWhen": "examined"
    },

    "bray.attic-key": {
        "names": ["key", "iron key"],
        "traits": ["movable"],
        "descriptions": {
            "indefinite": "an iron key",
            "definite": "the iron key",
            "detailed": "A heavy iron key."
        },
        "location": { "location": "bray.bookcase", "position": "on" }
    },

    "bray.book": {
        "names": ["book", "mysteries", "mysteries of the unknown"],
        "traits": ["movable"],
        "descriptions": {
            "indefinite": "a well-read book",
            "definite": "the book",
            "detailed": "The book seems well read and falls open on a page with a number of pencil marks in the margins. “It has been said that, like land or titles or wealth, the black mark can be passed down through a family from parent to child, sometimes passing over several generations before manifesting once more. Such an inheritance is doubtless less appealing to family members, for who in their right mind would choose to bear such a terrible burden?”"
        },
        "location": "bray.bookcase"
    },

}
